app/controllers/recipes_controller.rb

  def show
    id = params[:id]
    begin
      @recipe = Recipe.find(id)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

  def create
    begin
      r = Recipe.new(create_update_params)
      r.save
---
INSERT INTO "recipes" ("name", "directions", "cuisine", "calories", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sad"], ["directions", "def"], ["cuisine", "italian"], ["calories", 100], ["created_at", "2019-04-07 16:48:35.006662"], ["updated_at", "2019-04-07 16:48:35.006662"]]

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

  def update
    recipe = Recipe.find(params[:id])
    begin
      recipe.update(create_update_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "directions" = ?, "cuisine" = ?, "calories" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Guacamole"], ["directions", "Mash avocados, lime juice, and salt together"], ["cuisine", "Mexican"], ["calories", 400], ["updated_at", "2019-04-10 05:35:57.062010"], ["id", 19]]

  def destroy
      recipe = Recipe.find(params[:id])
      begin
          recipe.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 20]]