app/models/user.rb

   def validate_username
     if User.where(email: username).exists?
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test"], ["LIMIT", 1]]